iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/гисСлоиКарты/гисСлоиКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гисСлоиКарты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипСлоя</name>
    <type>
      <types>EnumRef.гисТипыСлоев</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипГеометрии</name>
    <type>
      <types>EnumRef.гисТипыГеометрии</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>CatalogRef.гисКартинкиТочечныхОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаливкаЦвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаливкаНепрозрачность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГраницыЦвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ГраницыНепрозрачность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГраницыТолщина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СправочникОбъектовУчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СправочникОбъектовУчетаВладелец</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьОтображать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМасштабОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьМасштабДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматГеоданных</name>
    <type>
      <types>EnumRef.гисФорматыГеоданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГисСерверАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГисСерверИмяСлоя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсплывающееСообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОтображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

iTower_20__GIS_Управление_пространственными_данными/src/Enums/гисТипыСлоев/гисТипыСлоев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гисТипыСлоев</name>
  <enumValues>
    <name>ПоСправочникуОбъектыКарты</name>
  </enumValues>
  <enumValues>
    <name>ПоСправочникуКадастровыеЗемельныеУчастки</name>
  </enumValues>
  <enumValues>
    <name>ИзФайла</name>
  </enumValues>
  <enumValues>
    <name>Росреестр</name>
  </enumValues>
  <enumValues>
    <name>WMS</name>
  </enumValues>
</mdclass:Enum>

iTower_20__GIS_Управление_пространственными_данными/src/Enums/гисТипыГеометрии/гисТипыГеометрии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гисТипыГеометрии</name>
  <enumValues>
    <name>Точка</name>
  </enumValues>
  <enumValues>
    <name>Линия</name>
  </enumValues>
  <enumValues>
    <name>Полигон</name>
  </enumValues>
</mdclass:Enum>

iTower_20__GIS_Управление_пространственными_данными/src/Catalogs/гисСлоиКарты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ЭтоГруппа Тогда
		ПроверяемыеРеквизиты.Добавить("ТипСлоя");
			
		Если ТипСлоя = Перечисления.гисТипыСлоев.ПоСправочникуОбъектыКарты Тогда
			ПроверяемыеРеквизиты.Добавить("ТипГеометрии");
			Если ТипГеометрии = Перечисления.гисТипыГеометрии.Точка Тогда
				ПроверяемыеРеквизиты.Добавить("Картинка");
			КонецЕсли;
		ИначеЕсли ТипСлоя = Перечисления.гисТипыСлоев.ИзФайла Тогда
			ПроверяемыеРеквизиты.Добавить("ФорматГеоданных");
			ПроверяемыеРеквизиты.Добавить("ТекстФайла");
		ИначеЕсли ТипСлоя = Перечисления.гисТипыСлоев.WMS Тогда
			ПроверяемыеРеквизиты.Добавить("ГисСерверАдрес");
			ПроверяемыеРеквизиты.Добавить("ГисСерверИмяСлоя");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
